# Packages
brew "btop"
brew "coreutils"
brew "curl"
brew "docker"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "fd"
brew "gh"
brew "git"
brew "lazydocker"
brew "lazygit"
brew "jq"
brew "libpq"
brew "libyaml"
brew "mise"
brew "overmind"
brew "pnpm"
brew "ripgrep"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zplug"

# Cask applications
cask "1password"
cask "google-chrome"
cask "alt-tab"
cask "alacritty"
cask "iterm2"
cask "obsidian"
cask "rectangle"
cask "slack"
cask "keepingyouawake"
cask "spotify"
cask "flameshot"
cask "postman"
cask "visual-studio-code"
cask "docker-desktop"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-commit-mono"
cask "font-dm-sans"
cask "font-fira-code"
cask "font-geist"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-geist-mono"
cask "font-google-sans-code"
cask "font-work-sans"
